003_mechanicalSimilarity/001_pimpleFoam_Re20_L0.002_U0.15_nu1.5e-5/Allrun.pre
#!/bin/bash

blockMesh
mirrorMesh -dict system/mirrorMeshDict.X -overwrite
mirrorMesh -dict system/mirrorMeshDict.Y -overwrite
autoPatch 45 -overwrite
createPatch -overwrite
extrudeMesh
transformPoints -scale "(0.1 0.1 0.1)"
