003_mechanicalSimilarity/001_pimpleFoam_Re20_L0.002_U0.15_nu1.5e-5/system/pressureCoefficient
pressureCoefficient1
{
    type            pressure;
    libs            (fieldFunctionObjects);

    mode            staticCoeff;

    result          cp;

    rho             rhoInf;
    rhoInf          1.2;
    pInf            0;
    UInf            (0.15 0 0);

    // Inherited entries
    writeControl    writeTime;
}
